{
  "message.text": {
    "0": "#SaudiArabia #flood #climate #destruction #anomaly  \n Heavy floods due to extreme rains in Taif of Saudi Arabia 🇸🇦 (20.09.2023)\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Commons - www.creativesociety.com",
    "1": "#Swedish #climate #disruption #anomaly  \n 🇸🇪 A cold atmospheric front unleashed heavy snowfall on the Swedish city of Kiruna, setting a record with a 38 cm snow cover forming within just one day! This is the highest snowfall recorded in the city's history of meteorological observations since 1905. The previous record was 21 cm, observed in 1932.\"\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Commons - www.creativesociety.com",
    "2": "#Uganda #flooding #climate #disruption #anomaly\n🇺🇬 On September 20, 2023, a heavy downpour caused flooding in the capital of Uganda, the city of Kampala. The deluge inflicted significant damage to the city's infrastructure, submerging homes and transportation.\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com",
    "3": "#climate #disruption #anomaly #SaudiArabia \n🇸🇦Iridescent cloud captured from the Tanomah Mountains, Asir Province, Saudi Arabia \n📹 @Salman1_89\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com",
    "4": "#climate #destruction #anomaly #Russia \n🇷🇺 Scientists from the Institute of Volcanology and Seismology, who studied the active Shiveluch volcano in Kamchatka, Russia have shared footage from the very heart of the gas and steam 'inferno'.\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com",
    "5": "Video of a powerful solar eruption that triggered a magnetic storm and a bright aurora on September 19.\n\nA massive solar filament detached from the Sun on September 16, causing a coronal mass ejection towards Earth. Three days later, the stream reached our planet, interacting with its magnetic field and producing stunning polar lights, even at mid-latitudes. The storm was classified as G3 — strong (the most catastrophic being G5), with its peak occurring on the day of September 19, Moscow time.\n\n💬 Solar physicist Kate Strong shared on social media: \"The largest eruption I have ever seen! I have been professionally observing the Sun for over 50 years, and this is the most significant 'filamentary' eruption in my memory.",
    "6": "#USA #tornado  #climate #destruction #anomaly  \n🇺🇸 Tornado of non-mesocyclonic origin in Kansas, USA, \nSeptember 19, 2023\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com",
    "7": "#China #tornado #climate #destruction #anomaly \n🇨🇳 On September 19th, a devastating tornado struck the Chinese city of Sutian (Jiangsu Province, China). It was brief but ruthless, tearing through the city center and resulting in a significant number of injuries and, sadly, the loss of 5 lives.\n\nThe video footage also captures the aftermath: overturned vehicles, roofs torn off, and power lines severed. Rescue operations were promptly organized, and assistance was provided to the affected individuals\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com",
    "8": "#magneticstorm\nWeather-Dependent Subscribers Information\nThe magnetic storm that raged on Earth, with brief interruptions, for almost a day, ended late Tuesday evening. According to mathematical models' forecasts, we can expect a calmer magnetosphere of the planet in the next 2-3 days, and the state of the geomagnetic field will fluctuate from quiet to unstable.\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com",
    "9": "#climate #flood #destruction #anomaly #Iran\n🇮🇷 The province of Gilan, located in arid Iran, is known for its moderate and humid climate, but such levels of precipitation have never been observed here. The video captures a flood in Gilan Province (Iran, September 18, 2023).\n\nFollow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com"
  },
  "message.date": {
    "0": 1695308506000,
    "1": 1695301324000,
    "2": 1695294096000,
    "3": 1695286875000,
    "4": 1695279731000,
    "5": 1695231490000,
    "6": 1695212550000,
    "7": 1695204084000,
    "8": 1695196819000,
    "9": 1695193251000
  },
  "extracted.location": {
    "0": "City: Taif\nState: Not provided in the text\nCountry: Saudi Arabia",
    "1": "City: Kiruna\nState: N/A\nCountry: Sweden",
    "2": "City: Kampala\nState: Unknown\nCountry: Uganda",
    "3": "City: Tanomah\nState: Asir Province\nCountry: Saudi Arabia",
    "4": "Location: Kamchatka, Russia",
    "5": "Location: Moscow, Russia",
    "6": "The location information extracted from the text is Kansas, USA.",
    "7": "City: Sutian\nState: Jiangsu Province\nCountry: China",
    "8": "Unfortunately, the given text does not provide any specific information about the location or country affected by the magnetic storm. Therefore, it is not possible to extract the location details and structure them as city, state, country.",
    "9": "City: Gilan\nState: Gilan Province\nCountry: Iran"
  },
  "extracted.date": {
    "0": "The date information in the text is \"20.09.2023.\" Therefore, the structured date is \"20th September 2023.\"",
    "1": "The date information from the text is not provided.",
    "2": "The date mentioned in the text is September 20, 2023.",
    "3": "Unfortunately, without the specific date mentioned in the provided text, it is not possible to extract the date information.",
    "4": "Unfortunately, the provided text does not contain any specific dates or time information regarding the study conducted by the scientists from the Institute of Volcanology and Seismology in Russia.",
    "5": "The date information can be extracted and structured as follows:\n\nTime: Not specified\nDay: 19\nMonth: September\nYear: Not specified",
    "6": "The date information from the text is \"September 19, 2023\".",
    "7": "The date of the tornado in Sutian, China is September 19th.",
    "8": "The text does not provide any specific date information regarding the magnetic storm.",
    "9": "The flood in Gilan Province, Iran occurred on September 18, 2023."
  },
  "extracted.event": {
    "0": "Name of event: Heavy floods in Taif, Saudi Arabia (20.09.2023)\nDescription of Event: \n\nOn September 20, 2023, Taif, a city in Saudi Arabia, experienced heavy floods as a result of extreme rainfall. This natural disaster caused significant destruction and was considered an anomaly due to the severity of the floods. The heavy rains led to widespread flooding in the city, resulting in damage to infrastructure, homes, and properties.\n\nThe floods in Taif highlighted the vulnerability of the region to extreme weather events and raised concerns about the impact of climate change. The event serves as a reminder of the urgent need for effective disaster management strategies and measures to mitigate the risks posed by such natural disasters.\n\nFor more information, please follow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2",
    "1": "Name of event: Record-breaking snowfall in Kiruna, Sweden\nDescription of Event: A cold atmospheric front resulted in heavy snowfall in the Swedish city of Kiruna, leading to the formation of a 38 cm snow cover within just one day. This snowfall broke the previous record of 21 cm, which had been observed in 1932. It is the highest amount of snowfall ever recorded in the city's history of meteorological observations since 1905.",
    "2": "Name of Event: Flooding in Kampala, Uganda\nDescription of Event: On September 20, 2023, a heavy downpour in the capital city of Uganda, Kampala, led to severe flooding. The excessive rainfall caused significant damage to the city's infrastructure, resulting in the submersion of homes and transportation systems. The flooding disrupted the normal functioning of the city and posed a threat to the well-being and safety of its residents.",
    "3": "Name of event: Iridescent Cloud in Tanomah Mountains, Asir Province, Saudi Arabia\n\nDescription of Event: \n\nThis event showcases the stunning phenomenon of an iridescent cloud captured in the Tanomah Mountains of the Asir Province in Saudi Arabia. The video, shared by @Salman1_89 on social media, displays the captivating beauty of the colorful cloud formation.\n\nThe iridescent cloud, also known as a rainbow cloud, is a rare atmospheric optical phenomenon that occurs when water droplets or ice crystals in the air scatter sunlight, creating a spectrum of colors. This mesmerizing display of colors against the backdrop of the Tanomah Mountains provides a unique and breathtaking experience for viewers.\n\nThe event highlights the natural beauty and wonders of Saudi Arabia's landscapes, particularly in the Asir Province. The Tanomah Mountains, with their picturesque scenery, serve as a perfect setting for capturing such extraordinary occurrences.\n\nThis footage serves as a reminder of the diverse and awe-inspiring natural phenomena that exist in our world, emphasizing the importance of preserving and appreciating our environment.",
    "4": "Name of event: Study of Shiveluch volcano in Kamchatka, Russia\n\nDescription of Event: Scientists from the Institute of Volcanology and Seismology conducted a study on the active Shiveluch volcano in Kamchatka, Russia. They have shared footage depicting the gas and steam 'inferno' from the heart of the volcano. The study aimed to analyze the volcanic activity and its impact on the climate.",
    "5": "Name of event: Solar Eruption and Magnetic Storm\nDescription of Event: On September 19, a powerful solar eruption occurred, triggered by a massive solar filament that detached from the Sun on September 16. This event resulted in a coronal mass ejection towards Earth, leading to a magnetic storm. The storm was classified as G3 (strong), with its peak occurring on September 19, Moscow time. The interaction of the coronal mass ejection with Earth's magnetic field produced stunning polar lights, even at mid-latitudes. Solar physicist Kate Strong described it as the largest eruption she has ever seen in her more than 50 years of professional observation of the Sun.",
    "6": "Name of event: Tornado of non-mesocyclonic origin in Kansas, USA\nDescription of Event: On September 19, 2023, a destructive tornado occurred in Kansas, USA. This tornado, which was of non-mesocyclonic origin, brought about significant destruction in its path. The event is considered an anomaly due to its unique characteristics. For more information and updates on this event, you can follow us on social media platforms such as Instagram (shorturl.at/fkpZ9), Facebook (shorturl.at/guBH2), and our website Creative Society (www.creativesociety.com).",
    "7": "Name of event: Tornado in Sutian, Jiangsu Province, China\nDescription of Event: \nOn September 19th, a devastating tornado struck the Chinese city of Sutian, located in Jiangsu Province, China. The tornado was brief but caused significant destruction as it tore through the city center. Tragically, it resulted in the loss of 5 lives and left numerous people injured.\n\nVideo footage of the aftermath shows the extent of the damage, with overturned vehicles, roofs torn off buildings, and power lines severed. Prompt rescue operations were initiated, and assistance was provided to those affected by the disaster.\n\nFor more information and updates, follow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com",
    "8": "Event Name: Magnetic Storm\nDescription: The magnetic storm that recently occurred on Earth lasted for almost a day, with brief interruptions. It finally came to an end late Tuesday evening. Mathematical models' forecasts indicate that the planet's magnetosphere is expected to be calmer in the next 2-3 days. However, the state of the geomagnetic field will still fluctuate, ranging from quiet to unstable. Stay updated with the latest information by following us on social media platforms:\n- Instagram: shorturl.at/fkpZ9\n- Facebook: shorturl.at/guBH2\n- Creative Society: Visit www.creativesociety.com for more event details.",
    "9": "Name of event: Unprecedented Flood in Gilan Province, Iran\nDescription of Event: \n\nThe province of Gilan, situated in arid Iran, experienced an extraordinary event on September 18, 2023. Known for its moderate and humid climate, Gilan had never witnessed such high levels of precipitation before. A video capturing the devastating flood in Gilan Province surfaced, highlighting the destruction caused by this anomaly.\n\nThis unprecedented flood brought about significant damage to the province, impacting both infrastructure and communities. Buildings, roads, and agricultural fields were submerged, causing widespread destruction. The local population faced immense challenges, including displacement, loss of property, and disruptions to their daily lives.\n\nThe event underscored the vulnerability of Gilan Province to climate change, as the region is not accustomed to such extreme weather patterns. The flood emphasized the urgent need for adaptive measures and infrastructure improvements to mitigate future risks.\n\nFor more updates and information, follow us on social media:\nInstagram - shorturl.at/fkpZ9\nFacebook - shorturl.at/guBH2\nCreative Society - www.creativesociety.com"
  }
}